//
//  ExcercisesData.swift
//  gyming
//
//  Created by gleba on 04.03.2023.
//

import Foundation
struct ExcercisesData{
    static let exerciseDictionary = [
        "Full Body": [
            "Подъемы ног на перекладине",
            "Жим гантелей в наклоне лежа",
            "Тяга верхнего блока в тренажере",
            "Жим гантелей сидя",
            "Сгибания со штангой стоя",
            "Французский жим лежа",
            "Жим ногами лежа",
            "Подъемы на носки сидя"
        ],
        "Грудь": [
            "Жим штанги лежа горизонтально",
            "Жим штанги лежа в наклоне",
            "Жим гантелей лежа в наклоне",
            "Отжимания от брусьев",
            "Жим в наклоне в Смите",
            "Сведения рук в кроссовере",
            "Отжимания от пола"
        ],
        "Спина": [
            "Подтягивания на перекладине широким хватом",
            "Подтягивания на перекладине обратным хватом",
            "Тяга верхнего блока широким хватом",
            "Тяга верхнего блока обратным хватом",
            "Тяга нижнего блока",
            "Тяга штанги в наклоне",
            "Тяга гантели в наклоне",
            "Пулловер с веревкой"
        ],
        "Плечи": [
            "Жим гантелей сидя",
            "Жим гантелей стоя",
            "Жим штанги стоя",
            "Жим штанги сидя",
            "Махи в стороны сидя",
            "Махи в стороны стоя",
            "Подъемы гантелей перед собой",
            "Махи с гантелями в наклоне",
            "Разведения в тренажере стоя"
        ],
        "Руки": [
        "Сгибания со штангой стоя",
        "Сгибание с гантелями сидя",
        "Сгибания со штангой на скамье Скотта",
        "Концентрированное сгибание с гантелей сидя поочередно",
        "Сгибания с гантелями в стиле молот стоя",
        "Сгибания со штангой стоя обратным хватом",
        "Разгибания в тренажере с веревочной рукоятью",
        "Французский жим лежа с гантелями",
        "Французский жим лежа со штангой",
        "Французский жим сидя с гантелью",
        "Разгибания с гантелью в наклоне «Кик Бэк»",
        "Тыльные отжимания от скамьи"
        ],
        "Ноги": [
        "Разгибания ног в тренажере",
        "Жим ногами в тренажере",
        "Сгибания ног в тренажере",
        "Приседания со штангой",
        "Приседания в Смите",
        "Приседания в Гакк машине",
        "Приседания в широкой постановке с гирей",
        "Зашагивания на тумбу поочередно",
        "Сведения ног",
        "Разведения ног",
        "Подъемы на носки стоя в Смите",
        "Подъемы на носки сидя"
        ],
        "Пресс": [
        "Подъемы ног в перекладине",
        "Скручивания на мяче",
        "Скручивания в тренажере с веревочной рукоятью «Молитва»"
        ]
        ]
}
